Revit 2027 API
VoltageTypeSet.Insert Method
Insert the specified voltage type into the set.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual bool Insert(
	VoltageType item
)
Public Overridable Function Insert (
	item As VoltageType
) As Boolean
public:
virtual bool Insert(
	VoltageType^ item
)
abstract Insert :
        item : VoltageType -> bool
override Insert :
        item : VoltageType -> bool
Parameters
item VoltageType
The voltage type to be inserted into the set.
Return Value
Boolean
Returns whether the voltage type was inserted into the set.
See Also
Reference
VoltageTypeSet Class
Autodesk.Revit.DB.Electrical Namespace